0      2
1      4
2      6
3      8
4    500
dtype: int64
True
({'index': 4, 'ratio': 96.15}, '贡献量达到九成（96.15%）')
({'index': 4, 'ratio_to_second': 62, 'ratio_to_min': 250}, '是其余数据的62到250倍')
({'index': -1}, None)
({'index': -1}, None)
({'index': -1}, None)
-----------------------------------------------------------
0     2
1     4
2     6
3    30
4    50
dtype: int64
True
({'index': 4, 'ratio': 54.35}, '贡献量超过总量的一半（54.35%）')
({'index': -1}, None)
({'index': 4, 'index_second': 3, 'ratio': 86.96}, '占总体的绝大部分（86.96%）')
({'index': -1}, None)
({'index': -1}, None)
-----------------------------------------------------------
0    5
1    4
2    4
3    5
4    5
dtype: int64
True
({'index': -1}, None)
({'index': -1}, None)
({'index': -1}, None)
({'index': -1}, None)
({'index': 0, 'mean': 4.6}, '分布平均')
-----------------------------------------------------------
0      5
1     -2
2     -4
3     -6
4     -8
5   -100
dtype: int64
True
({'index': 0}, '仅有一个正值，需要进一步分析')
({'index': -1}, None)
({'index': -1}, None)
({'index': 5, 'ratio_to_second': 12, 'ratio_to_min': 50}, '是其余数据的12到50倍')
({'index': -1}, None)
-----------------------------------------------------------